В игре Plants & Gardens каждый месяц проводятся тематические события, ограниченные по времени. В них игроки могут получить уникальные предметы для сада и персонажей, дополнительные монеты или бонусы. Для получения награды требуется пройти ряд уровней за определенное время. С помощью каких метрик можно оценить результаты последнего прошедшего события?

Предположим, в другом событии мы усложнили механику событий так, что при каждой неудачной попытке выполнения уровня игрок будет откатываться на несколько уровней назад. Изменится ли набор метрик оценки результата? Если да, то как?

----------------------------
**Событие 1**
<br><u>KPI's - на что мы будем смотреть</u>
<br>(сравниваем с предыдущими событиями и, если актуально, с предыдущими периодами с учетом сезонности)

- DAU - количество уникальных пользователей в день. 

- Event Success Rate - % игроков успешно прошедших событие от всех начавших прохождение. Если он слишком высокий, игрокам, конечно, радостно, но нам надо смотреть на метрики монетизации. Было так легко, что не пришлось тратить реальные деньги на прохождение, или так хотелось получить награды, что пришлось купить путь к успеху?

- Paywall CR - конверсия в покупку активных офферов при проблемах с прохождением уровня (если применимо). В зависимости от механики, может разделяться на hard/soft - купи доп.время или бустеры за 100 рублей / за 100 монет.
- ARPU, ARPPU - средняя выручка на игрока, с возможностью сегментации участник события / нет. 

- Retention - удержание, аналогично с возможностью сегментации участник события / нет. 
- Event Time Share (per session) - доля времени прохождения события от длины игровой сессии. Значение близкое к 100% означает, что игроки заходили в игру больше ради события, чем ради игры.

*Event/Level CSAT* (customer satisfaction score)
<br> *Если пользователь может оценить событие/уровень (поставить после прохождения 1-5 звезд, лайк/дизлайк) - средняя оценка. Быстрый способ понять, как сами пользователи оценивают наше событие.*

*(Result) Sharing CR:*
<br>*Если у нас есть опция поделиться результатом в соцсетях (e.g. смотрите, я прошел событие X в Plant and Gardens и теперь у меня красивейшая уникальная пальма) : игроки, нажавшие кнопку "поделиться в соцсетях" / все игроки увидевшие кнопку*

<u>Метрики события</u> - где будем искать факторы влияния на KPI

Общая воронка прохождения события: 
- EAU - event active users: 
<br>количество уникальных пользователей, вошедших в игру во время события 
- *Event Discovery*
<br> *количество уникальных пользователей, попавших на экран старта события (если для попадания на него нужны активные действия пользователя)*
- Event Attendance 
<br> количество уникальных пользователей, начавших прохождение события 
- Level Success
<br> количество уникальных пользователей, успешно завершивших каждый уровень
- *Event Success*
<br> *количество уникальных пользователей, успешно завершивших событие (если это отдельное от последнего уровня действие, например нажать кнопку "Ура!")* 
- *Reward Claimed*
<br> *количество уникальных пользователей, забравших награду (если для этого необходимо активное действие)* 

Уровни:
- Level Winrate 
<br> победы на уровне / все старты прохождения уровня
- Level Drop-off
<br> игроки, прекратившие проходить событие после поражения на уровне / все игроки проходившие уровень
- Time per Level
<br> Время на успешное прохождение уровня. Если по времени ограничено не только событие, но и каждый уровень, может быть преобразовано в TpL Rate (среднее время на успешное прохождение / лимит времени на прохождение).
- Attempts per Level
<br> Количество попыток прохождения уровня. Среднее по всем начавшим уровень, а также по всем его завершившим.
- Resourses per Level - средние затраты монет / бустов на уровне. 

Награды и баланс:
- Coins Spent per User - количество потраченных монет / уникальные пользователи 
- Coins Gained per User - количество полученных монет / уникальные пользователи. Поможет гейм-дизайнеру отследить, что событие не сломало нам баланс.
- Если игрок самостоятельно выбирает награду - распределение выбора между товарами. Поможет узнать, ради чего игроки проходили событие (помимо самого процесса).


**Событие 2**
<br>Набор метрик оставим прежним, чтобы была возможность полноценно сравнить механики. 
<br>Однако, в метриках событий (уровни) предусмотрим сегментацию - первая сессия прохождения / повторная (после отката).
<br>А также введем вспомогательную метрику Failure per User, в которой будем ослеживать среднее количество откатов на пользователя.
